Revit 2024 API
GroupTypeId.RailingSystemSegmentPatternRepeat Property
 Pattern Repeat.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId RailingSystemSegmentPatternRepeat { get; }
Visual Basic
Public Shared ReadOnly Property RailingSystemSegmentPatternRepeat As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RailingSystemSegmentPatternRepeat {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace